{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 16, 112, 112], "sparse": false}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_1", "nb_filter": 32, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_1", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_2", "nb_filter": 32, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_2", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["elu_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_3", "nb_filter": 64, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_3", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_4", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["elu_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_5", "nb_filter": 128, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_5", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_6", "nb_filter": 128, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_6", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["elu_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_7", "nb_filter": 256, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_7", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_8", "nb_filter": 256, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_8", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_4", "config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_9", "nb_filter": 512, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_9", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_10", "nb_filter": 512, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_10", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "config": {"name": "upsampling2d_1", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_10", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_mask": null, "name": "merge_1", "dot_axes": -1, "arguments": {}, "mode": "concat", "concat_axis": 1, "mode_type": "raw", "output_mask_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_1", 0, 0], ["elu_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_11", "nb_filter": 256, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_11", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_12", "nb_filter": 256, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_12", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "config": {"name": "upsampling2d_2", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_12", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_mask": null, "name": "merge_2", "dot_axes": -1, "arguments": {}, "mode": "concat", "concat_axis": 1, "mode_type": "raw", "output_mask_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["elu_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_13", "nb_filter": 128, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_13", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "ELU", "name": "elu_13", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_14", "nb_filter": 128, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_13", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_14", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "ELU", "name": "elu_14", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_3", "config": {"name": "upsampling2d_3", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_14", 0, 0]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"output_mask": null, "name": "merge_3", "dot_axes": -1, "arguments": {}, "mode": "concat", "concat_axis": 1, "mode_type": "raw", "output_mask_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_3", 0, 0], ["elu_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_15", "nb_filter": 64, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_15", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "ELU", "name": "elu_15", "config": {"name": "elu_15", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_16", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_16", "nb_filter": 64, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_15", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_16", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "ELU", "name": "elu_16", "config": {"name": "elu_16", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_4", "config": {"name": "upsampling2d_4", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["elu_16", 0, 0]]]}, {"class_name": "Merge", "name": "merge_4", "config": {"output_mask": null, "name": "merge_4", "dot_axes": -1, "arguments": {}, "mode": "concat", "concat_axis": 1, "mode_type": "raw", "output_mask_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["upsampling2d_4", 0, 0], ["elu_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_17", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_17", "nb_filter": 32, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_17", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "ELU", "name": "elu_17", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_18", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "he_uniform", "nb_row": 3, "b_constraint": null, "border_mode": "same", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "linear", "W_constraint": null, "name": "convolution2d_18", "nb_filter": 32, "b_regularizer": null, "nb_col": 3}, "inbound_nodes": [[["elu_17", 0, 0]]]}, {"class_name": "Cropping2D", "name": "cropping2d_1", "config": {"name": "cropping2d_1", "cropping": [[16, 16], [16, 16]], "trainable": true}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_18", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "axis": 1, "trainable": true}, "inbound_nodes": [[["cropping2d_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_18", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_19", "config": {"dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 1, "b_constraint": null, "border_mode": "valid", "trainable": true, "bias": true, "subsample": [1, 1], "activation": "sigmoid", "W_constraint": null, "name": "convolution2d_19", "nb_filter": 1, "b_regularizer": null, "nb_col": 1}, "inbound_nodes": [[["elu_18", 0, 0]]]}], "name": "model_1", "output_layers": [["convolution2d_19", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.2"}